export const dataAboutMe = {
  avatar: {
    descriptionPath: 'Avatar',
    title: 'Я - Frontend Разработчик,',
    subtitle:
      'которому нравится не просто писать код, а находить оптимальные решения. Люблю экспериментировать, пробовать новое и совершенствовать свои навыки. Мне важно, чтобы продукт был не только функциональным, но и удобным, эстетичным и приятным в использовании.',
  },
  experience: [
    {
      id: 1,
      time: 'Ноябрь 2023 - Февраль 2025',
      nameCompany: 'Oggetto',
      position: 'Frontend Developer',
      responsibilities: [
        'Разработка и поддержка интернет-магазинов на платформе Magento2 для брендов косметики;',
        'Настройка и создание событий для Google Analytics (GA) для отслеживания  пользовательских действий на сайте, включая клики, просмотры блоков,  показы продуктов, переходы на детальные страницы товаров и другие ключевые метрики;',
        'Вёрстка и реализация фронтенд-функционала на основе макетов из Figma;',
        'Взаимодействие с командой дизайнеров для точной реализации макетов, соблюдение стандартов дизайна и обеспечения высокого качества пользовательского интерфейса;',
        'Взаимодействие с командой аналитики для внедрения необходимых событий для сбора данных и улучшения анализа пользовательского поведения;',
        'Обеспечение совместимости сайта с различными браузерами и устройствами, в том числе создание адаптивных страниц;- Оптимизация пользовательского интерфейса для улучшен',
        'Оптимизация пользовательского интерфейса для улучшения скорости загрузки страниц и повышения производительности;- Разработка адаптивного и динамического интерфейса внутри ',
        'Разработка адаптивного и динамического интерфейса внутри iframe для интеграции с внешними сайтами, с целью отображения тестов и интерактивных элементов;',
        'Разработка для внутреннего проекта функционала на checkout-е,связанного с весом заказа и стоимостью доставки;',
        'Создание HTML-писем для рассылки клиентам внутреннего продукта.',
      ],
      hashtags: [
        'JavaScript',
        'JQuery',
        'Magento 2',
        'HTML',
        'Css/Scss',
        'Git',
        'Адаптивная/Кроссбраузерная вёрстка',
      ],
    },
    {
      id: 2,
      time: 'Январь 2023 - Ноябрь 2023',
      nameCompany: 'UMAX',
      position: 'Frontend Developer',
      responsibilities: [
        'Разработка и поддержка лендингов на Vue.js и Nuxt.js, с акцентом на удобство и функциональность интерфейса;',
        'Создание внутреннего продукта, включая разработку админ-панели для управления контентом;',
        'Разработка интерфейса интернет магазина с использованием JavaScript. Обеспечение кросс-браузерности интерфейса для корректного отображения и функционирования сайта;',
        'Оптимизация сайтов для улучшения скорости загрузки страниц и повышения общей производительности;',
        'Вёрстка по макетам в Figma. Взаимодействие с дизайнерами для реализации UI/UX решений, соответствующих стандартам и требованиям заказчика;',
        'Разработка и дизайн HTML-писем для email-рассылок, включая создание адаптивных шаблонов для различных почтовых клиентов.',
      ],
      hashtags: [
        'Vue.js',
        'Nuxt.js',
        'JavaScript',
        'HTML',
        'Css/Scss',
        'Git',
        'Адаптивная/Кроссбраузерная вёрстка',
      ],
    },
  ],
  edication: [
    {
      name: ' Донской Государственный Технический Университет',
      position: 'Бакалавр,  Программная инженерия (09.03.04)',
      time: '2018 - 2022',
    },
  ],
};
