export const dataAboutMe = {
  avatar: {
    descriptionPath: "Avatar",
    title: "Я - Frontend Разработчик,",
    subtitle:
      "которому нравится не просто писать код, а находить оптимальные решения. Люблю экспериментировать, пробовать новое и совершенствовать свои навыки. Мне важно, чтобы продукт был не только функциональным, но и удобным, эстетичным и приятным в использовании.",
  },
  experience: [
    {
      id: 1,
      time: "Ноябрь 2023 - Февраль 2025",
      nameCompany: "Oggetto",
      position: "Frontend Developer",
      responsibilities: [
        "Разработка и внедрение фронтенд-функционала с использованием React, JavaScript, TypeScript;",
        "Разработка и поддержка интернет-магазинов на платформе Magento 2;",
        "Интеграция событий в Google Analytics (GA) для отслеживания пользовательских действий;",
        "Взаимодействие с дизайнерами и аналитиками для точной реализации макетов, соблюдения стандартов UX/UI на основе макетов Figma, обеспечение pixel perfect дизайна, внедрения необходимых событий и улучшения сбора данных;",
        "Оптимизация производительности и скорости загрузки пользовательского интерфейса;",
        "Обеспечение кроссбраузерной и адаптивной верстки для корректного отображения на различных устройствах;",
        "Создание HTML-писем для email-рассылок.",
      ],
      hashtags: [
        "React.js",
        "JavaScript",
        "JQuery",
        "Magento 2",
        "HTML",
        "Css/Scss",
        "Git",
        "Адаптивная/Кроссбраузерная вёрстка",
      ],
    },
    {
      id: 2,
      time: "Январь 2023 - Ноябрь 2023",
      nameCompany: "UMAX",
      position: "Frontend Developer",
      responsibilities: [
        "Разработка и поддержка лендингов, интернет-магазинов, админ-панели на React.js, Vue.js, Nuxt.js с акцентом на удобство и функциональность интерфейса;",
        "Оптимизация сайтов для повышения скорости загрузки страниц и общей производительности;",
        "Взаимодействие с дизайнерами для реализации UI/UX-решений в соответствии с требованиями заказчика, а также с SEO-специалистами для улучшения поисковой оптимизации и удобства пользователей;",
        " Разработка и дизайн адаптивных HTML-писем для email-рассылок, совместимых с различными почтовыми клиентами.",
      ],
      hashtags: [
        "React.js",
        "Next.js",
        "Redux",
        "Vue.js",
        "Nuxt.js",
        "Pinia",
        "JavaScript",
        "HTML",
        "Css/Scss",
        "Git",
        "Адаптивная/Кроссбраузерная вёрстка",
      ],
    },
  ],
  edication: [
    {
      name: " Донской Государственный Технический Университет",
      position: "Бакалавр,  Программная инженерия (09.03.04)",
      time: "2018 - 2022",
    },
  ],
};
