export const dataAboutMe = {
  avatar: {
    descriptionPath: "Avatar",
    title: "Я - Frontend Разработчик,",
    subtitle:
      "которому нравится не просто писать код, а находить оптимальные решения. Люблю экспериментировать, пробовать новое и совершенствовать свои навыки. Мне важно, чтобы продукт был не только функциональным, но и удобным, эстетичным и приятным в использовании.",
  },
  experience: [
    {
      id: 1,
      time: "Ноябрь 2023 - Февраль 2025",
      nameCompany: "Oggetto",
      position: "Frontend Developer",
      responsibilities: [
        "Разработка и внедрение фронтенд-функционала с использованием React.js, JavaScript для различных веб-приложений, включая поддержку и развитие интернет-магазинов на платформе Magento 2;",
        "Интеграция событий из DataLayer в Google Analytics (GA) для отслеживания пользовательских действий по ТЗ аналитиков;",
        "Оптимизация производительности и скорости загрузки пользовательского интерфейса;",
        "Взаимодействие с дизайнерами для соблюдения стандартов UX/UI на основе макетов Figma, обеспечение Pixel Perfect дизайна;",
        "Оценка задач и взаимодействие с Project Manager (PM) для планирования и соблюдения сроков, работа по методологии Scrum с двухнедельными спринтами и релизами на проекте.",
      ],
      achievements: [
        "Участвовала в настройке событийной аналитики через код с использованием JavaScript и Data Layer для отслеживания действий пользователей на страницах интернет-магазина косметики, что позволило SEO-специалистам анализировать поведение аудитории и повысить эффективность взаимодействия с веб-страницами;",
        "Разработала и внедрила новый функционал расчёта стоимости доставки на странице checkout для внутреннего интернет-магазина компании, в условиях перехода с бесплатной на платную доставку. Это улучшило точность расчётов для сотрудников, ускорило процесс оформления заказов и снизило количество ошибок, что способствовало повышению общей эффективности работы.",
      ],
      hashtags: [
        "React.js",
        "JavaScript",
        "JQuery",
        "Magento 2",
        "HTML",
        "Css/Scss",
        "Git",
        "Адаптивная/Кроссбраузерная вёрстка",
      ],
    },
    {
      id: 2,
      time: "Январь 2023 - Ноябрь 2023",
      nameCompany: "UMAX",
      position: "Frontend Developer",
      responsibilities: [
        "Разработка и оптимизация web-приложений и интернет-магазинов с использованием React.js, Next.js, Vue.js, Nuxt.js и нативного JavaScript;",
        "Доработка и расширение функциональности существующих проектов с учетом бизнес-требований;",
        "Повышение производительности и сокращение времени загрузки страниц за счёт оптимизации ресурсов и архитектурных решений;",
        "Настройка и внедрение SEO-решений совместно с SEO-специалистами для повышения видимости и эффективности индексации;",
        "Работа в тесной связке с web-дизайнерами над улучшением UX/UI, обеспечивая адаптивность и удобство пользовательского интерфейса;",
        "Взаимодействие с backend-разработчиками для интеграции с API и обеспечения стабильного обмена данными между фронтендом и серверной частью;",
        "Сотрудничество с Project-менеджерами для планирования задач, оценки сроков разработки и соблюдения дедлайнов.",
      ],
      achievements: [
        "Внесла ключевой вклад в разработку web-приложения и админ панели для доставки еды из ресторана с интеграцией Telegram miniApp. Пользователи получили возможность оформлять заказы без сайта и регистрации, что упростило процесс и увеличило конверсию с мобильных устройств;",
        "Разработала интерактивный интерфейс для жилого комплекса с визуализацией этапов строительства и планировок квартир. Улучшенный пользовательский интерфейс и функциональность привели к увеличению количества звонков в отдел продаж на 35%, в том числе по вопросам ипотеки, ставок и условий покупки;",
        "Сыграла ключевую роль в оптимизации web-приложения по продаже окон и дверей. Благодаря проведённой работе производительность выросла с ~50 до 90+ на десктопах и с ~40 до 80+ на мобильных устройствах, согласно PageSpeed Insights.",
      ],
      hashtags: [
        "React.js",
        "Next.js",
        "Redux",
        "Vue.js",
        "Nuxt.js",
        "Pinia",
        "JavaScript",
        "HTML",
        "Css/Scss",
        "Git",
        "Адаптивная/Кроссбраузерная вёрстка",
      ],
    },
  ],
  edication: [
    {
      name: " Донской Государственный Технический Университет",
      position: "Бакалавр,  Программная инженерия (09.03.04)",
      time: "2018 - 2022",
    },
  ],
};
